# Напишите программу, которая получает от пользователя число n и выводит n строк с результатом умножения чисел от 1 до n на символ 

# если n = 3

# значит у нас будет 3 строки
#  в строке должно быть написанно
 
#  умножа. символ $ * 1 

# n = int(input())

# for i in range(int(input())):
    
# for n in 


for 

numbers = range(1, 6, 2)
print(numbers) # => range(1, 6, 2)