# написать цикл for который выведет мне число от 4 до 8

# for i in range(4, 9): # условие
#     print(i) # тело цикло. здесь отображенно действие


# Вывести на экран все числа от 50 до 150 включительно с помощью цикла while.


# i = 50

# while i <= 150:
#     print(i)
#     i = i+1


# Вывести на экран при помощи цикла while следующий ряд чисел: 13, 20, 27 ...., 349.

# n = 13

# while n <=349:
#     print (n)
#     n = n+7


# Напишите программу, которая при помощи цикла while сделает обратный отсчет от 15 до 0 (включительно) и затем выведет "Поехали!" в самом конце.

p=15

while p  <= 15 and p >=0:
    print(p)
    p = p-1

print("Поехали")
